//Project: air_purifier.prj
// Device: FT62F13X
// Memory: Flash 3KX14b, EEPROM 128X8b, SRAM 256X8b
// Author: 
//Company: 
//Version:
//   Date: 
/*  文件名 uart.c
*	功能： IO模拟uart时序
*   IC:    FT61F13 SOP20
*   晶振：  16M/2T                    
*   说明： 波特率9600, 传输1bit的时间约等于0.104ms
*		        数据由1bit起始位+8bit数据位+1bit停止位共10bit的数据帧组成，起始位为低电平，停止位为高电平
*
*
*                  FT61F13  SOP20
*                 ----------------
*  VDD-----------|1(VDD)   (VSS)20|------------VSS     
*  NC------------|2(PC1)   (PA0)19|------------NC 
*  NC------------|3(PC0)   (PA1)18|------------NC
*  NC------------|4(PB7)   (PA2)17|------------DemoPortIn
*  NC------------|5(PB6)   (PA3)16|------------NC
*  NC------------|6(PB5)   (PA4)15|-------DemoPortOut
*  NC------------|7(PB4)   (PA5)14|------------NC
*  NC------------|8(PB3)   (PA6)13|------------NC
*  NC------------|9(PB2)   (PA7)12|------------NC
*  NC------------|10(PB1)  (PB0)11|------------NC
*                 ----------------   
*/
//===========================================================
//===========================================================
#include	"SYSCFG.h"
#include	"public.h"

//===========================================================
//Variable definition
//===========================================================
//宏定义****************************************************
#define 	unchar     	unsigned char 
#define 	unint         unsigned int
#define  	unlong 		unsigned long

/*----------------------------------------------------
 *	函数名称：TIMER0_INITIAL
 *	功能：初始化设置定时器
 *	相关寄存器：T0CS T0SE PSA 
 *	设置TMR0定时时长8.192ms=(1/16000000)*2*256*255(16M-2T-PSA 1:256- TMR0=255溢出)	       
 * 设置TMR0定时时长0.104ms=(1/16000000)*2*256*(3)
	255 - 3 = 252 =0xFC;
 ----------------------------------------------------*/
void TIMER0_INITIAL (void)  
{
	OPTION = 0B00000111;	//Bit5 T0CS Timer0时钟源选择 
							//1-外部引脚电平变化T0CKI 0-内部时钟(FOSC/2)
							//Bit4 T0CKI引脚触发方式 1-下降沿 0-上升沿
							//Bit3 PSA 预分频器分配位 0-Timer0 1-WDT 
							//Bit2:0 PS2 8个预分频比 111 - 1:256
                            
	TMR0 = TIMER0_RELOAD_VALUE;
	T0IF = 0;				//清空T0软件中断
}
    
/*----------------------------------------------------
 *	函数名称：DelayUs
 *	功能：   短延时函数 --16M-2T--大概快1%左右.
 *	输入参数：Time延时时间长度 延时时长Time Us
 *	返回参数：无 
 ----------------------------------------------------*/


//===========================================================
